{
    "version": "https://jsonfeed.org/version/1",
    "title": "Victor Henry",
    "description": "",
    "home_page_url": "https://henryvictor.github.io/case-study",
    "feed_url": "https://henryvictor.github.io/case-study/feed.json",
    "user_comment": "",
    "author": {
        "name": "Victor Henry"
    },
    "items": [
        {
            "id": "https://henryvictor.github.io/case-study/superhive-collaborative-newsletter.html",
            "url": "https://henryvictor.github.io/case-study/superhive-collaborative-newsletter.html",
            "title": "SuperHive Collaborative Newsletter",
            "summary": "SuperHive est une solution de newsletter collaborative qui permet à ses clients de récolter des avis, des demandes ou encore&hellip;",
            "content_html": "\n  <p>\n    SuperHive est une solution de newsletter collaborative qui permet à ses clients de récolter des avis, des demandes ou encore des propositions sous forme de posts. Ces posts sont ensuite agrégés par un administrateur et publiés dans une newsletter envoyée à tous les membres d'une communauté donnée. La nouveauté, c'est que les posts des membres de la communauté sont recueillis au sein même de la newsletter, par le biais de formulaires intégrés au mail.\n  </p>\n\n  <p>\n    À L'occasion d'une rencontre autour de leur projet, j'ai eu l'occasion de me pencher sur l'organisation de SuperHive et l'expérience de ses utilisateurs.\n  </p>\n\n    <figure class=\"blockquote\">\n      <blockquote>SuperHive cuts through the noise, notifications, messages and app-switching to offer one simple, revolutionary interactive email that triggers real-time engagement from where your community already is: In their inbox.</blockquote>\n      <figcaption>SuperHive website</figcaption>\n    </figure>\n\n    <h2 id=\"description-du-projet\">\n      Description du projet\n    </h2>\n\n  <p>\n    Cette solution \"intra mail\" permet une grande diffusion et une facilité d'accès certaine. Pas besoin de se connecter sur un espace personnel sur un site web, tout est envoyé depuis le client mail et l'utilisateur peut répondre aux posts ou proposer le sien pour la prochaine newsletter via des formulaires.&nbsp;\n  </p>\n\n  <p>\n    L'utilisateur est directement exposé aux nouveautés provenant de sa communauté et il n'y a que peu de décisions à prendre pour choisir le contenu, l'administrateur peut, par défaut, intégrer tous les posts proposés par les membres durant la semaine dans la prochaine newsletter.\n  </p>\n\n    <h2 id=\"problmatique\">\n      Problématique\n    </h2>\n\n  <p>\n    Cette facilité d'accès au contenu vient avec des contreparties. Tout d'abord, l'utilisateur moyen d'internet n'est pas habitué au fait de pouvoir réellement interagir avec un email, dans la plupart des cas, l'interaction se limite à cliquer sur un lien pour ouvrir une page web, mais pas à remplir un formulaire pour ensuite l'envoyer en cliquant sur un bouton.\n  </p>\n\n  <p>\n    Ce manque de sensibilisation de l'utilisateur à cette nouvelle méthode engendre un engagement timide des membres vis à vis des newsletters qu'ils reçoivent. On peut facilement imaginer une réaction très automatique vis à vis d'un email, une technologie utilisée de manière unidirectionnelle, ou presque, depuis plus de 15 ans.\n  </p>\n\n  <p>\n    La problématique principale de SuperHive est donc de parvenir à informer ses utilisateurs rapidement et efficacement sur ce qu'est leur service et ce qu'il peut leur apporter (le temps moyen consacré à un email étant très limité) afin de se prémunir d'une perte totale de contact avec le dit utilisateur et d'une baisse dramatique de l'engagement, mettant en danger la viabilité même du produit.\n  </p>\n\n    <h2 id=\"lutilisateur\">\n      L'utilisateur\n    </h2>\n\n  <p>\n    L'utilisateur de SuperHive est membre d'une communauté dont l'administrateur a pris la décision d'utiliser SuperHive. Il n'est donc pas forcément préparé à recevoir une newsletter particulière, son email a peut-être été ajouté via l'interface d'administration par un fichier CSV. Certains ont pu bénéficier d'un onboarding au travers d'une join page, mais cette fonctionnalité n'est présente que si l'administrateur l'active depuis sont interface de gestion.\n  </p>\n\n  <p>\n    Habitué aux emails et aux newsletter, il est coutumier du fait qu'un email est le plus souvent un medium unidirectionnel : la marque, l'interlocuteur, fournit une information, le receveur la lit et passe au message suivant. Il n'a probablement jamais vu d'email réellement interactif.\n  </p>\n\n    <h2 id=\"rle-et-responsabilits\">\n      Rôle et responsabilités\n    </h2>\n\n  <p>\n    Mon rôle lors de cette rencontre a été de participer à mettre en place une méthode UX capable de fournir des informations utiles au développement futur du corps de la newsletter et du service SuperHive en général.\n  </p>\n\n  <p>\n    J'ai procédé à la création de documents de travail tels que des schémas d'user journey ou encore une synthèse de tests utilisateurs ayant eu lieu précédemment.<br>À l'aide de ces documents, j'ai pu proposer des axes d'amélioration du service censés diminuer la fracture entre l'utilisateur et le service et ainsi augmenter la compréhension et l'engagement vis à vis de la newsletter.\n  </p>\n\n    <h2 id=\"scope-du-projet-et-contraintes\">\n      Scope du projet et contraintes\n    </h2>\n\n  <p>\n    Le projet était avant tout centré sur la newsletter, la façon dont elle apparaîtrait aux yeux de l'utilisateur. Cela impliquait des modifications de layout très précises et ciblées sur les plus grosses incompréhensions. Il n'étais pas possible de tout résoudre grace à des indications textuelles, l'attention de l'utilisateur étant déjà un point très sensible.\n  </p>\n\n  <p>\n    Les deux principales contraintes de ce projet étaient le niveau d'attention de l'utilisateur, comme dit précédemment, un utilisateur habitué à recevoir des emails n'y consacre jamais beaucoup de temps, notre newsletter doit donc se dévoiler et convaincre en très peu de temps et avec peu de texte, pour des raisons évidentes.\n  </p>\n\n  <p>\n    La seconde contrainte est une limitation technique, l'intégration d'emails lisibles sur la plupart des clients mails suppose d'utiliser des standards parfois très dépassés. Il n'est pas question d'intégrer des vidéos, des éléments trop interactifs, etc. En réalité, le simple fait de pouvoir utiliser des formulaires et des boutons d'envoi (sans javascript, évidemment) n'est dû qu'a la relative modernité du client gmail. Certains éléments indispensables à la bonne compréhension d'un formulaire, tels que des placeholders, sont parfois impossibles à intégrer dans les règles de l'art, cela réduit grandement les possibilités créatives et les solutions possibles.\n  </p>\n\n    <h2 id=\"le-processus\">\n      Le processus\n    </h2>\n\n  <p>\n    Avec les membres de l'équipe fondatrice, nous avons commencé par analyser les feedbacks utilisateurs reçus récemment. Ces retours ont été très instructifs car ils soulevaient de nombreux points d'incompréhension. Quasi toujours remontés par des administrateurs de communautés, ils nous ont permis de mieux cibler les points d'accrochage entre les utilisateurs (qui remontaient l'incompréhension à leur administrateur) et le produit.\n  </p>\n\n  <p>\n    Une fois les feedbacks synthétisés et classés, j'ai entrepris de les reformuler sous forme de problèmes de design. Ces problématiques orientées et reformulées sont plus à même de nous aiguiller durant la phase d'idéation.\n  </p>\n\n  <p>\n    Vient ensuite la phase d'idéation durant laquelle nous avons jeté un maximum d'idées et de variations de design sur un fichier Figma, autour de captures d'écran du produit actuel afin que nous puissions y laisser des commentaires, superposer de nouveaux éléments, etc. Ces idées allaient de la mise en conformité de certains éléments (absence de placeholders, de labels, etc.) à une refonte de l'information au sein de la newsletter (intitulé de certains boutons ou titres, ajout d'une section explicative type onboarding).\n  </p>\n\n  <p>\n    Cette phase achevée, je me suis concentré sur la création d'un prototype reprenant les principales modifications issues de la phase d'idéation. J'ai également mené une réflexion afin de déterminer quel changement conserver ou lesquels prioriser sur le prototype. Dans certains cas, des variantes de prototypes ont été créées, ceci dans le but de pouvoir présenter une évolution graduelle de certaines modifications lors des tests utilisateurs futurs.\n  </p>\n\n  <p>\n    Enfin, nous avons pu préparer un document de support contenant des questions en vue des interviews utilisateurs (\"Comment répondriez-vous à ce post ?\", \"Pensez-vous qu'il soit difficile de publier une demande dans la newsletter ?\"). Ces questions, orientées afin de pouvoir mesurer le point de vue des interviewés sur les nouveautés et changements, nous ont permis de cadrer les interviews, chacune durant entre quinze et trente minutes. Chaque interview a été réalisée sur Zoom et était enregistrée.\n  </p>\n\n  <p>\n    Nous avons présenté le prototype principal ainsi que certaines variations de design aux utilisateurs tout en parcourant le questionnaire. Les notes étaient rédigées en regardant l'enregistrement afin de ne pas ralentir ou dénaturer les interviews.\n  </p>\n\n    <h2 id=\"rsultats-obtenus\">\n      Résultats obtenus\n    </h2>\n\n    <figure class=\"post__image post__image--center\">\n      <img loading=\"lazy\" src=\"https://henryvictor.github.io/case-study/media/posts/2/SuperHive_presentation_image2.png\" sizes=\"(min-width: 37.5em) 1600px, 80vw\" srcset=\"https://henryvictor.github.io/case-study/media/posts/2/responsive/SuperHive_presentation_image2-xs.png 384w ,https://henryvictor.github.io/case-study/media/posts/2/responsive/SuperHive_presentation_image2-sm.png 600w ,https://henryvictor.github.io/case-study/media/posts/2/responsive/SuperHive_presentation_image2-md.png 768w ,https://henryvictor.github.io/case-study/media/posts/2/responsive/SuperHive_presentation_image2-lg.png 1200w ,https://henryvictor.github.io/case-study/media/posts/2/responsive/SuperHive_presentation_image2-xl.png 1600w\"  height=\"1200\" width=\"1600\" alt=\"\" />\n      \n    </figure>\n\n  <p>\n    Forts de ces nouveaux retours utilisateurs, nous avons pu confirmer l'utilité de certains changements de design tels que la section explicative permettant un mini onboarding des utilisateurs, supprimer ceux qui n'avaient pas eu l'effet escompté (comme certains textes explicatifs qui rendaient au final le layout trop lourd, et donc décourageaient l'utilisateur). Nous avons ensuite continué à travailler sur le prototype pour en faire une nouvelle version en adéquation avec les retours récents en vue d'une nouvelle série d'interviews.\n  </p>\n\n  <p>\n    Cette nouvelle boucle de réflexion - design - interviews nous a permis de nous rapprocher d'un produit sans frictions et d'un service compréhensible, qui fait comprendre par son design ce qu'il attend de l'utilisateur et ce qu'il lui apporte.\n  </p>",
            "image": "https://henryvictor.github.io/case-study/media/posts/2/SuperHive_presentation_image.png",
            "author": {
                "name": "Victor Henry"
            },
            "tags": [
                   "Product Design"
            ],
            "date_published": "2022-08-23T14:04:16+02:00",
            "date_modified": "2022-08-23T19:30:11+02:00"
        },
        {
            "id": "https://henryvictor.github.io/case-study/cavas-security-app.html",
            "url": "https://henryvictor.github.io/case-study/cavas-security-app.html",
            "title": "Cavas Security App",
            "summary": "La société Cavas développe de nombreux outils de sécurité qu’elle propose à ses clients au travers d’une application SAAS. À&hellip;",
            "content_html": "<p>La société Cavas développe de nombreux outils de sécurité qu’elle propose à ses clients au travers d’une application SAAS. À l’occasion d’une refonte de cette application, j’ai eu l’occasion de participer au développement d’une nouvelle organisation des informations au sein de cette application ainsi qu’à une refonte du parcours et de la navigation.</p>\n<blockquote>\n<p>Le groupe Cavas est un intégrateur de solutions de sécurité depuis plus de 14 ans. Nous proposons à nos clients une offre complète d’installations sur-mesure.</p>\n</blockquote>\n<h2 id=\"description-du-projet\">Description du projet</h2>\n<p>À l’origine du projet, il y a la volonté d’intégrer plusieurs panels de services au sein d’une même application. Cette application devra offrir un confort d’utilisation ainsi qu’une grande ergonomie à ses utilisateurs, parfois agents de sécurité, qui seront amenés à monitorer l’activité d’un site via tablette ou desktop. Des wireframes avaient déjà été créés par une ingénieure de l’équipe Cavas, les services étaient donc déjà délimités.</p>\n<h2 id=\"problématique\">Problématique</h2>\n<p>Faire rentrer un grand nombre de services au sein d’une application peut se révéler compliqué, mener à des erreurs et engendrer un produit alambiqué que l’utilisateur ne parviendra pas à bien apréhender. La navigation au sein de l’application était une problématique importante car c’est ce point qui permettrait de rendre le service réellement utilisable en toutes situations, notre utilisateur pouvant être amené à se déplacer à travers le site tout en utilisant certains services de l’application.</p>\n<h2 id=\"lutilisateur\">L’utilisateur</h2>\n<p>Qu’il soit agent de sécurité ou préposé à la maintenance et au monitoring de la sécurité du site, l’utilisateur de l’application ne passe pas la journée dans son bureau. Son emploi du temps est flexible et il peut être amené à se déplacer pour contrôler visuellement les installations de sécurité (caméras, détecteurs de mouvement, portes, issues de secours, etc.).</p>\n<p>Pour cette raison, il nous a fallu adapter le produit à ce profil d’utilisateur ainsi qu’aux principaux devices sur lequels il allait être affiché.</p>\n<h2 id=\"rôle-et-responsabilités\">Rôle et responsabilités</h2>\n<p>Mon rôle en tant que prestataire pour l’équipe de développement Cavas fut de cadrer le processus d’idéation et de recherche utilisateur tout en étant accompagné des ingénieurs et des développeurs.</p>\n<p>J’ai tout d’abord procédé à la création d’un planning afin de segmenter les phases d’analyse des retours utilisateurs, d’idéation et de prototypage.</p>\n<p>Ensuite, je me suis occupé de mettre en place, avec l’équipe, des sessions de travail auxquelles tout le monde pouvait participer, ceci afin de récupérer un maximum d’informations sur le produit, l’historique de son architecture, le contexte, et sa cible.</p>\n<h2 id=\"scope-du-projet-et-contraintes\">Scope du projet et contraintes</h2>\n<p>La prestation concernait l’ensemble du parcours utilisateur sur toute l’application. Ce parcours était divisé en grands user flows correspondants à chaque service, ces derniers ayants tous des fonctionnalités différentes, et donc des parcours différents demandant une harmonisation dans leur fonctionnement.</p>\n<p>La principale contrainte du projet était le volume d’informations à présenter à chaque étape du parcours. En effet, un service, par exemple de monitoring des incidents de sécurité, pouvait d’abord présenter un écran d’accueil présentant un résumé des tickets de rapport d’incidents, puis permettre de rapporter un incident, d’examiner chaque ticket, de classer les informations ou de les discriminer selon des filtres, d’exporter le tableau des rapports en CSV, etc.</p>\n<h2 id=\"le-processus\">Le processus</h2>\n<p>L’équipe et moi-même avons commencé par définir nos objectifs principaux : un produit harmonisé, une navigation simple et adaptée à la mobilité des utilisateurs, aussi bien sur tablette que sur desktop, avec de préférence un maximum de trois clics pour atteindre n’importe quelle fonctionnalité.</p>\n<p>Associés à ces objectifs, des indicateurs de réussite ont également été définis, tels que le temps nécessaire pour générer un ticket de rapport d’incident, le temps nécessaire à la consultation de la carte des installations de sécurité, le nombre de tickets traités, etc.</p>\n<p>Le travail de prototypage a pu commencer en prenant appui sur les retours utilisateurs des phases antérieures au projet, à commencer par l’intégration d’un nouveau modèle de navigation latérale permettant d’articuler l’application. À cette barre latérale s’ajoute une navigation contextuelle sur la partie gauche de l’écran, elle permet l’affichage de menus dropdown, utiles pour certains services proposant de nombreuses sous options.</p>\n<p>Une fois la navigation prototypée, le reste du contenu des services a été harmonisé au travers de plusieurs composants afin de créer un design system complet : tableaux, champs, boutons, fil d’ariane, typographie, etc.</p>\n<p>Ces éléments réunis, nous avons été en mesure d’assembler le prototype final, écran par écran, chaque fonctionnalité à sa place, dans un produit entièrement revisité.</p>\n<h2 id=\"résultats-obtenus\">Résultats obtenus</h2>\n<p><figure class=\"post__image\"><img loading=\"lazy\" src=\"https://henryvictor.github.io/case-study/media/posts/1/Cavas_Pres.png\" sizes=\"(min-width: 37.5em) 1600px, 80vw\" srcset=\"https://henryvictor.github.io/case-study/media/posts/1/responsive/Cavas_Pres-xs.png 384w ,https://henryvictor.github.io/case-study/media/posts/1/responsive/Cavas_Pres-sm.png 600w ,https://henryvictor.github.io/case-study/media/posts/1/responsive/Cavas_Pres-md.png 768w ,https://henryvictor.github.io/case-study/media/posts/1/responsive/Cavas_Pres-lg.png 1200w ,https://henryvictor.github.io/case-study/media/posts/1/responsive/Cavas_Pres-xl.png 1600w\"  alt=\"Présentation de l&#39;application Cavas Security\" width=\"1600\" height=\"1200\" /></figure></p>\n<p>L’application Cavas de monitoring présente à présent les caractéristiques d’un service parfaitement utilisable, nos indicateurs de performance définis en amont montrent que le temps nécéssaire à un utilisateur pour réaliser des tâches habituelles a diminué, le rapport d’un ticket d’incident ne demande plus que trois actions, contre 5 précédemment.</p>\n<p>Les utilisateurs confrontés au prototype ont unanimement salué la nouvelle méthode de navigation ainsi que l’harmonisation de la signalétique et des contrôles de l’application. Le gain en clarté s’est traduit par une diminution des temps d’hésitation lors de la navigation, les erreurs de parcours sont aussi moins nombreuses.</p>\n<p>Le design system conçu a aussi permis d’accélérer le développement de nouvelles fonctionnalités, les développeurs bénéficiant désormais d’une plus grande marge de manoeuvre grace à une bibliothèque de composants, typos, icônes,  et couleurs clé en main.</p>\n",
            "image": "https://henryvictor.github.io/case-study/media/posts/1/Cavas_presentation_image2.png",
            "author": {
                "name": "Victor Henry"
            },
            "tags": [
                   "Product Design"
            ],
            "date_published": "2022-08-22T20:02:48+02:00",
            "date_modified": "2022-08-23T12:41:05+02:00"
        }
    ]
}
